Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/**
 * \file IfxEth_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: tc39x_its_SFR_V1.0.1_1.3_230715.xml dated 28.07.2015
 * Specification: its_V1.0.1_1.3.pdf
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Eth_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Eth
 *
 */
#ifndef IFXETH_BF_H
#define IFXETH_BF_H                                                    1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eth_BitfieldsMask
 * \{  */

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN0 */
#define IFX_ETH_ACCEN0_EN0_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN0 */
#define IFX_ETH_ACCEN0_EN0_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN0 */
#define IFX_ETH_ACCEN0_EN0_OFF                                         (0)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN10 */
#define IFX_ETH_ACCEN0_EN10_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN10 */
#define IFX_ETH_ACCEN0_EN10_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN10 */
#define IFX_ETH_ACCEN0_EN10_OFF                                        (10)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN11 */
#define IFX_ETH_ACCEN0_EN11_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN11 */
#define IFX_ETH_ACCEN0_EN11_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN11 */
#define IFX_ETH_ACCEN0_EN11_OFF                                        (11)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN12 */
#define IFX_ETH_ACCEN0_EN12_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN12 */
#define IFX_ETH_ACCEN0_EN12_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN12 */
#define IFX_ETH_ACCEN0_EN12_OFF                                        (12)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN13 */
#define IFX_ETH_ACCEN0_EN13_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN13 */
#define IFX_ETH_ACCEN0_EN13_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN13 */
#define IFX_ETH_ACCEN0_EN13_OFF                                        (13)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN14 */
#define IFX_ETH_ACCEN0_EN14_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN14 */
#define IFX_ETH_ACCEN0_EN14_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN14 */
#define IFX_ETH_ACCEN0_EN14_OFF                                        (14)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN15 */
#define IFX_ETH_ACCEN0_EN15_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN15 */
#define IFX_ETH_ACCEN0_EN15_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN15 */
#define IFX_ETH_ACCEN0_EN15_OFF                                        (15)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN16 */
#define IFX_ETH_ACCEN0_EN16_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN16 */
#define IFX_ETH_ACCEN0_EN16_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN16 */
#define IFX_ETH_ACCEN0_EN16_OFF                                        (16)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN17 */
#define IFX_ETH_ACCEN0_EN17_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN17 */
#define IFX_ETH_ACCEN0_EN17_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN17 */
#define IFX_ETH_ACCEN0_EN17_OFF                                        (17)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN18 */
#define IFX_ETH_ACCEN0_EN18_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN18 */
#define IFX_ETH_ACCEN0_EN18_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN18 */
#define IFX_ETH_ACCEN0_EN18_OFF                                        (18)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN19 */
#define IFX_ETH_ACCEN0_EN19_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN19 */
#define IFX_ETH_ACCEN0_EN19_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN19 */
#define IFX_ETH_ACCEN0_EN19_OFF                                        (19)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN1 */
#define IFX_ETH_ACCEN0_EN1_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN1 */
#define IFX_ETH_ACCEN0_EN1_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN1 */
#define IFX_ETH_ACCEN0_EN1_OFF                                         (1)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN20 */
#define IFX_ETH_ACCEN0_EN20_LEN                                        (1)

