Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN20 */
#define IFX_ETH_ACCEN0_EN20_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN20 */
#define IFX_ETH_ACCEN0_EN20_OFF                                        (20)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN21 */
#define IFX_ETH_ACCEN0_EN21_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN21 */
#define IFX_ETH_ACCEN0_EN21_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN21 */
#define IFX_ETH_ACCEN0_EN21_OFF                                        (21)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN22 */
#define IFX_ETH_ACCEN0_EN22_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN22 */
#define IFX_ETH_ACCEN0_EN22_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN22 */
#define IFX_ETH_ACCEN0_EN22_OFF                                        (22)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN23 */
#define IFX_ETH_ACCEN0_EN23_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN23 */
#define IFX_ETH_ACCEN0_EN23_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN23 */
#define IFX_ETH_ACCEN0_EN23_OFF                                        (23)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN24 */
#define IFX_ETH_ACCEN0_EN24_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN24 */
#define IFX_ETH_ACCEN0_EN24_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN24 */
#define IFX_ETH_ACCEN0_EN24_OFF                                        (24)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN25 */
#define IFX_ETH_ACCEN0_EN25_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN25 */
#define IFX_ETH_ACCEN0_EN25_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN25 */
#define IFX_ETH_ACCEN0_EN25_OFF                                        (25)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_OFF                                        (26)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_OFF                                        (27)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_OFF                                        (28)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_OFF                                        (29)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_OFF                                         (2)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_OFF                                        (30)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_OFF                                        (31)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_OFF                                         (3)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_OFF                                         (4)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_OFF                                         (5)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_OFF                                         (6)

