Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.RPBL */
#define IFX_ETH_BUS_MODE_RPBL_OFF                                      (17)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.SWR */
#define IFX_ETH_BUS_MODE_SWR_LEN                                       (1)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.SWR */
#define IFX_ETH_BUS_MODE_SWR_MSK                                       (0x1)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.SWR */
#define IFX_ETH_BUS_MODE_SWR_OFF                                       (0)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.TXPR */
#define IFX_ETH_BUS_MODE_TXPR_LEN                                      (1)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.TXPR */
#define IFX_ETH_BUS_MODE_TXPR_MSK                                      (0x1)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.TXPR */
#define IFX_ETH_BUS_MODE_TXPR_OFF                                      (27)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.USP */
#define IFX_ETH_BUS_MODE_USP_LEN                                       (1)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.USP */
#define IFX_ETH_BUS_MODE_USP_MSK                                       (0x1)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.USP */
#define IFX_ETH_BUS_MODE_USP_OFF                                       (23)

/** \brief  Length for Ifx_ETH_CLC_Bits.DISR */
#define IFX_ETH_CLC_DISR_LEN                                           (1)

/** \brief  Mask for Ifx_ETH_CLC_Bits.DISR */
#define IFX_ETH_CLC_DISR_MSK                                           (0x1)

/** \brief  Offset for Ifx_ETH_CLC_Bits.DISR */
#define IFX_ETH_CLC_DISR_OFF                                           (0)

/** \brief  Length for Ifx_ETH_CLC_Bits.DISS */
#define IFX_ETH_CLC_DISS_LEN                                           (1)

/** \brief  Mask for Ifx_ETH_CLC_Bits.DISS */
#define IFX_ETH_CLC_DISS_MSK                                           (0x1)

/** \brief  Offset for Ifx_ETH_CLC_Bits.DISS */
#define IFX_ETH_CLC_DISS_OFF                                           (1)

/** \brief  Length for
 * Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits.CURRBUFAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_LEN    (32)

/** \brief  Mask for
 * Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits.CURRBUFAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_MSK    (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits.CURRBUFAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_OFF    (0)

/** \brief  Length for Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits.CURRDESAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_LEN        (32)

/** \brief  Mask for Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits.CURRDESAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_MSK        (0xffffffff)

/** \brief  Offset for Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits.CURRDESAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_OFF        (0)

/** \brief  Length for
 * Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits.CURTBUFAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_LEN   (32)

/** \brief  Mask for
 * Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits.CURTBUFAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_MSK   (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits.CURTBUFAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_OFF   (0)

/** \brief  Length for Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits.CURTDESAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_LEN       (32)

/** \brief  Mask for Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits.CURTDESAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_MSK       (0xffffffff)

/** \brief  Offset for Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits.CURTDESAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_OFF       (0)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RFCFCSTS */
#define IFX_ETH_DEBUG_RFCFCSTS_LEN                                     (2)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RFCFCSTS */
#define IFX_ETH_DEBUG_RFCFCSTS_MSK                                     (0x3)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RFCFCSTS */
#define IFX_ETH_DEBUG_RFCFCSTS_OFF                                     (1)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RPESTS */
#define IFX_ETH_DEBUG_RPESTS_LEN                                       (1)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RPESTS */
#define IFX_ETH_DEBUG_RPESTS_MSK                                       (0x1)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RPESTS */
#define IFX_ETH_DEBUG_RPESTS_OFF                                       (0)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RRCSTS */
#define IFX_ETH_DEBUG_RRCSTS_LEN                                       (2)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RRCSTS */
#define IFX_ETH_DEBUG_RRCSTS_MSK                                       (0x3)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RRCSTS */
#define IFX_ETH_DEBUG_RRCSTS_OFF                                       (5)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RWCSTS */
#define IFX_ETH_DEBUG_RWCSTS_LEN                                       (1)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RWCSTS */
#define IFX_ETH_DEBUG_RWCSTS_MSK                                       (0x1)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RWCSTS */
#define IFX_ETH_DEBUG_RWCSTS_OFF                                       (4)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RXFSTS */
#define IFX_ETH_DEBUG_RXFSTS_LEN                                       (2)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RXFSTS */
#define IFX_ETH_DEBUG_RXFSTS_MSK                                       (0x3)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RXFSTS */
#define IFX_ETH_DEBUG_RXFSTS_OFF                                       (8)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TFCSTS */
#define IFX_ETH_DEBUG_TFCSTS_LEN                                       (2)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TFCSTS */
#define IFX_ETH_DEBUG_TFCSTS_MSK                                       (0x3)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TFCSTS */
#define IFX_ETH_DEBUG_TFCSTS_OFF                                       (17)

