Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_DEBUG_Bits.TPESTS */
#define IFX_ETH_DEBUG_TPESTS_LEN                                       (1)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TPESTS */
#define IFX_ETH_DEBUG_TPESTS_MSK                                       (0x1)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TPESTS */
#define IFX_ETH_DEBUG_TPESTS_OFF                                       (16)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TRCSTS */
#define IFX_ETH_DEBUG_TRCSTS_LEN                                       (2)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TRCSTS */
#define IFX_ETH_DEBUG_TRCSTS_MSK                                       (0x3)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TRCSTS */
#define IFX_ETH_DEBUG_TRCSTS_OFF                                       (20)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TWCSTS */
#define IFX_ETH_DEBUG_TWCSTS_LEN                                       (1)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TWCSTS */
#define IFX_ETH_DEBUG_TWCSTS_MSK                                       (0x1)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TWCSTS */
#define IFX_ETH_DEBUG_TWCSTS_OFF                                       (22)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TXFSTS */
#define IFX_ETH_DEBUG_TXFSTS_LEN                                       (1)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TXFSTS */
#define IFX_ETH_DEBUG_TXFSTS_MSK                                       (0x1)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TXFSTS */
#define IFX_ETH_DEBUG_TXFSTS_OFF                                       (24)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TXPAUSED */
#define IFX_ETH_DEBUG_TXPAUSED_LEN                                     (1)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TXPAUSED */
#define IFX_ETH_DEBUG_TXPAUSED_MSK                                     (0x1)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TXPAUSED */
#define IFX_ETH_DEBUG_TXPAUSED_OFF                                     (19)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_LEN                                    (1)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_MSK                                    (0x1)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_OFF                                    (25)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_LEN                                  (1)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_MSK                                  (0x1)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_OFF                                  (7)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_LEN                               (1)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_OFF                               (0)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_LEN                                   (2)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_MSK                                   (0x3)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_OFF                                   (4)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_LEN                                    (16)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_MSK                                    (0xffff)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_OFF                                    (16)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_LEN                                   (1)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_MSK                                   (0x1)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_OFF                                   (2)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_LEN                                   (1)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_MSK                                   (0x1)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_OFF                                   (1)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_LEN                                    (1)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_MSK                                    (0x1)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_OFF                                    (3)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_LEN                                    (4)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_MSK                                    (0xf)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_OFF                                    (2)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_LEN                                    (1)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_MSK                                    (0x1)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_OFF                                    (0)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_LEN                                    (5)

