Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_MSK                                    (0x1f)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_OFF                                    (6)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_LEN                                    (1)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_MSK                                    (0x1)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_OFF                                    (1)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_LEN                                    (5)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_MSK                                    (0x1f)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_OFF                                    (11)

/** \brief  Length for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_LEN                                       (16)

/** \brief  Mask for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_MSK                                       (0xffff)

/** \brief  Offset for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_OFF                                       (0)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_OFF                                        (0)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_LEN                                       (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_MSK                                       (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_OFF                                       (20)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_OFF                                        (2)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_OFF                                        (4)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_OFF                                        (6)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_OFF                                        (8)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_OFF                                        (10)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_OFF                                        (12)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_OFF                                        (14)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_OFF                                        (16)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_LEN                                        (2)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_MSK                                        (0x3)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_OFF                                        (18)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_LEN                                          (1)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_MSK                                          (0x1)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_OFF                                          (24)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.TCEN */
#define IFX_ETH_GPCTL_TCEN_LEN                                         (1)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.TCEN */
#define IFX_ETH_GPCTL_TCEN_MSK                                         (0x1)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.TCEN */
#define IFX_ETH_GPCTL_TCEN_OFF                                         (31)

/** \brief  Length for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_LEN                                (32)

/** \brief  Mask for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_MSK                                (0xffffffff)

/** \brief  Offset for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_OFF                                (0)

/** \brief  Length for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_LEN                                 (32)

/** \brief  Mask for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_MSK                                 (0xffffffff)

