Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.PCSSEL */
#define IFX_ETH_HW_FEATURE_PCSSEL_LEN                                  (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.PCSSEL */
#define IFX_ETH_HW_FEATURE_PCSSEL_MSK                                  (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.PCSSEL */
#define IFX_ETH_HW_FEATURE_PCSSEL_OFF                                  (6)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RWKSEL */
#define IFX_ETH_HW_FEATURE_RWKSEL_LEN                                  (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RWKSEL */
#define IFX_ETH_HW_FEATURE_RWKSEL_MSK                                  (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RWKSEL */
#define IFX_ETH_HW_FEATURE_RWKSEL_OFF                                  (9)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXCHCNT */
#define IFX_ETH_HW_FEATURE_RXCHCNT_LEN                                 (2)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXCHCNT */
#define IFX_ETH_HW_FEATURE_RXCHCNT_MSK                                 (0x3)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXCHCNT */
#define IFX_ETH_HW_FEATURE_RXCHCNT_OFF                                 (20)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXFIFOSIZE */
#define IFX_ETH_HW_FEATURE_RXFIFOSIZE_LEN                              (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXFIFOSIZE */
#define IFX_ETH_HW_FEATURE_RXFIFOSIZE_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXFIFOSIZE */
#define IFX_ETH_HW_FEATURE_RXFIFOSIZE_OFF                              (19)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXTYP1COE */
#define IFX_ETH_HW_FEATURE_RXTYP1COE_LEN                               (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXTYP1COE */
#define IFX_ETH_HW_FEATURE_RXTYP1COE_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXTYP1COE */
#define IFX_ETH_HW_FEATURE_RXTYP1COE_OFF                               (17)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXTYP2COE */
#define IFX_ETH_HW_FEATURE_RXTYP2COE_LEN                               (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXTYP2COE */
#define IFX_ETH_HW_FEATURE_RXTYP2COE_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXTYP2COE */
#define IFX_ETH_HW_FEATURE_RXTYP2COE_OFF                               (18)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.SAVLANINS */
#define IFX_ETH_HW_FEATURE_SAVLANINS_LEN                               (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.SAVLANINS */
#define IFX_ETH_HW_FEATURE_SAVLANINS_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.SAVLANINS */
#define IFX_ETH_HW_FEATURE_SAVLANINS_OFF                               (27)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.SMASEL */
#define IFX_ETH_HW_FEATURE_SMASEL_LEN                                  (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.SMASEL */
#define IFX_ETH_HW_FEATURE_SMASEL_MSK                                  (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.SMASEL */
#define IFX_ETH_HW_FEATURE_SMASEL_OFF                                  (8)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TSVER1SEL */
#define IFX_ETH_HW_FEATURE_TSVER1SEL_LEN                               (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TSVER1SEL */
#define IFX_ETH_HW_FEATURE_TSVER1SEL_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TSVER1SEL */
#define IFX_ETH_HW_FEATURE_TSVER1SEL_OFF                               (12)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TSVER2SEL */
#define IFX_ETH_HW_FEATURE_TSVER2SEL_LEN                               (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TSVER2SEL */
#define IFX_ETH_HW_FEATURE_TSVER2SEL_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TSVER2SEL */
#define IFX_ETH_HW_FEATURE_TSVER2SEL_OFF                               (13)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TXCHCNT */
#define IFX_ETH_HW_FEATURE_TXCHCNT_LEN                                 (2)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TXCHCNT */
#define IFX_ETH_HW_FEATURE_TXCHCNT_MSK                                 (0x3)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TXCHCNT */
#define IFX_ETH_HW_FEATURE_TXCHCNT_OFF                                 (22)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TXCOESEL */
#define IFX_ETH_HW_FEATURE_TXCOESEL_LEN                                (1)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TXCOESEL */
#define IFX_ETH_HW_FEATURE_TXCOESEL_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TXCOESEL */
#define IFX_ETH_HW_FEATURE_TXCOESEL_OFF                                (16)

/** \brief  Length for Ifx_ETH_ID_Bits.MODNUMBER */
#define IFX_ETH_ID_MODNUMBER_LEN                                       (16)

/** \brief  Mask for Ifx_ETH_ID_Bits.MODNUMBER */
#define IFX_ETH_ID_MODNUMBER_MSK                                       (0xffff)

/** \brief  Offset for Ifx_ETH_ID_Bits.MODNUMBER */
#define IFX_ETH_ID_MODNUMBER_OFF                                       (16)

/** \brief  Length for Ifx_ETH_ID_Bits.MODREV */
#define IFX_ETH_ID_MODREV_LEN                                          (8)

/** \brief  Mask for Ifx_ETH_ID_Bits.MODREV */
#define IFX_ETH_ID_MODREV_MSK                                          (0xff)

/** \brief  Offset for Ifx_ETH_ID_Bits.MODREV */
#define IFX_ETH_ID_MODREV_OFF                                          (0)

/** \brief  Length for Ifx_ETH_ID_Bits.MODTYPE */
#define IFX_ETH_ID_MODTYPE_LEN                                         (8)

/** \brief  Mask for Ifx_ETH_ID_Bits.MODTYPE */
#define IFX_ETH_ID_MODTYPE_MSK                                         (0xff)

/** \brief  Offset for Ifx_ETH_ID_Bits.MODTYPE */
#define IFX_ETH_ID_MODTYPE_OFF                                         (8)

/** \brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.AIE */
#define IFX_ETH_INTERRUPT_ENABLE_AIE_LEN                               (1)

