Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.LPIIM */
#define IFX_ETH_INTERRUPT_MASK_LPIIM_OFF                               (10)

/** \brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.PCSANCIM */
#define IFX_ETH_INTERRUPT_MASK_PCSANCIM_LEN                            (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.PCSANCIM */
#define IFX_ETH_INTERRUPT_MASK_PCSANCIM_MSK                            (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.PCSANCIM */
#define IFX_ETH_INTERRUPT_MASK_PCSANCIM_OFF                            (2)

/** \brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.PCSLCHGIM */
#define IFX_ETH_INTERRUPT_MASK_PCSLCHGIM_LEN                           (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.PCSLCHGIM */
#define IFX_ETH_INTERRUPT_MASK_PCSLCHGIM_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.PCSLCHGIM */
#define IFX_ETH_INTERRUPT_MASK_PCSLCHGIM_OFF                           (1)

/** \brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.PMTIM */
#define IFX_ETH_INTERRUPT_MASK_PMTIM_LEN                               (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.PMTIM */
#define IFX_ETH_INTERRUPT_MASK_PMTIM_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.PMTIM */
#define IFX_ETH_INTERRUPT_MASK_PMTIM_OFF                               (3)

/** \brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.RGSMIIIM */
#define IFX_ETH_INTERRUPT_MASK_RGSMIIIM_LEN                            (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.RGSMIIIM */
#define IFX_ETH_INTERRUPT_MASK_RGSMIIIM_MSK                            (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.RGSMIIIM */
#define IFX_ETH_INTERRUPT_MASK_RGSMIIIM_OFF                            (0)

/** \brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.TSIM */
#define IFX_ETH_INTERRUPT_MASK_TSIM_LEN                                (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.TSIM */
#define IFX_ETH_INTERRUPT_MASK_TSIM_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.TSIM */
#define IFX_ETH_INTERRUPT_MASK_TSIM_OFF                                (9)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_ETH_INTERRUPT_STATUS_LPIIS_LEN                             (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_ETH_INTERRUPT_STATUS_LPIIS_MSK                             (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_ETH_INTERRUPT_STATUS_LPIIS_OFF                             (10)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_LEN                             (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_MSK                             (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_OFF                             (4)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIPIS_LEN                         (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIPIS_MSK                         (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIPIS_OFF                         (7)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIS_LEN                           (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIS_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIS_OFF                           (5)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCTXIS_LEN                           (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCTXIS_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCTXIS_OFF                           (6)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSANCIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSANCIS_LEN                          (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSANCIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSANCIS_MSK                          (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSANCIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSANCIS_OFF                          (2)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSLCHGIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSLCHGIS_LEN                         (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSLCHGIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSLCHGIS_MSK                         (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSLCHGIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSLCHGIS_OFF                         (1)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_ETH_INTERRUPT_STATUS_PMTIS_LEN                             (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_ETH_INTERRUPT_STATUS_PMTIS_MSK                             (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_ETH_INTERRUPT_STATUS_PMTIS_OFF                             (3)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_ETH_INTERRUPT_STATUS_RGSMIIIS_LEN                          (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_ETH_INTERRUPT_STATUS_RGSMIIIS_MSK                          (0x1)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_ETH_INTERRUPT_STATUS_RGSMIIIS_OFF                          (0)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_ETH_INTERRUPT_STATUS_TSIS_LEN                              (1)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_ETH_INTERRUPT_STATUS_TSIS_MSK                              (0x1)

