Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_ETH_INTERRUPT_STATUS_TSIS_OFF                              (9)

/** \brief  Length for Ifx_ETH_KRST0_Bits.RST */
#define IFX_ETH_KRST0_RST_LEN                                          (1)

/** \brief  Mask for Ifx_ETH_KRST0_Bits.RST */
#define IFX_ETH_KRST0_RST_MSK                                          (0x1)

/** \brief  Offset for Ifx_ETH_KRST0_Bits.RST */
#define IFX_ETH_KRST0_RST_OFF                                          (0)

/** \brief  Length for Ifx_ETH_KRST0_Bits.RSTSTAT */
#define IFX_ETH_KRST0_RSTSTAT_LEN                                      (1)

/** \brief  Mask for Ifx_ETH_KRST0_Bits.RSTSTAT */
#define IFX_ETH_KRST0_RSTSTAT_MSK                                      (0x1)

/** \brief  Offset for Ifx_ETH_KRST0_Bits.RSTSTAT */
#define IFX_ETH_KRST0_RSTSTAT_OFF                                      (1)

/** \brief  Length for Ifx_ETH_KRST1_Bits.RST */
#define IFX_ETH_KRST1_RST_LEN                                          (1)

/** \brief  Mask for Ifx_ETH_KRST1_Bits.RST */
#define IFX_ETH_KRST1_RST_MSK                                          (0x1)

/** \brief  Offset for Ifx_ETH_KRST1_Bits.RST */
#define IFX_ETH_KRST1_RST_OFF                                          (0)

/** \brief  Length for Ifx_ETH_KRSTCLR_Bits.CLR */
#define IFX_ETH_KRSTCLR_CLR_LEN                                        (1)

/** \brief  Mask for Ifx_ETH_KRSTCLR_Bits.CLR */
#define IFX_ETH_KRSTCLR_CLR_MSK                                        (0x1)

/** \brief  Offset for Ifx_ETH_KRSTCLR_Bits.CLR */
#define IFX_ETH_KRSTCLR_CLR_OFF                                        (0)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_ETH_MAC_ADDRESS_HIGH_ADDRHI_LEN                            (16)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_ETH_MAC_ADDRESS_HIGH_ADDRHI_MSK                            (0xffff)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_ETH_MAC_ADDRESS_HIGH_ADDRHI_OFF                            (0)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_ETH_MAC_ADDRESS_HIGH_AE_LEN                                (1)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_ETH_MAC_ADDRESS_HIGH_AE_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_ETH_MAC_ADDRESS_HIGH_AE_OFF                                (31)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_ETH_MAC_ADDRESS_HIGH_MBC_LEN                               (6)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_ETH_MAC_ADDRESS_HIGH_MBC_MSK                               (0x3f)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_ETH_MAC_ADDRESS_HIGH_MBC_OFF                               (24)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_ETH_MAC_ADDRESS_HIGH_SA_LEN                                (1)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_ETH_MAC_ADDRESS_HIGH_SA_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_ETH_MAC_ADDRESS_HIGH_SA_OFF                                (30)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_ETH_MAC_ADDRESS_LOW_ADDRLO_LEN                             (32)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_ETH_MAC_ADDRESS_LOW_ADDRLO_MSK                             (0xffffffff)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_ETH_MAC_ADDRESS_LOW_ADDRLO_OFF                             (0)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_ETH_MAC_CONFIGURATION_ACS_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_ETH_MAC_CONFIGURATION_ACS_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_ETH_MAC_CONFIGURATION_ACS_OFF                              (7)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_ETH_MAC_CONFIGURATION_BE_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_ETH_MAC_CONFIGURATION_BE_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_ETH_MAC_CONFIGURATION_BE_OFF                               (21)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_ETH_MAC_CONFIGURATION_BL_LEN                               (2)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_ETH_MAC_CONFIGURATION_BL_MSK                               (0x3)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_ETH_MAC_CONFIGURATION_BL_OFF                               (5)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_ETH_MAC_CONFIGURATION_CST_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_ETH_MAC_CONFIGURATION_CST_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_ETH_MAC_CONFIGURATION_CST_OFF                              (25)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_ETH_MAC_CONFIGURATION_DC_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_ETH_MAC_CONFIGURATION_DC_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_ETH_MAC_CONFIGURATION_DC_OFF                               (4)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_ETH_MAC_CONFIGURATION_DCRS_LEN                             (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_ETH_MAC_CONFIGURATION_DCRS_MSK                             (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_ETH_MAC_CONFIGURATION_DCRS_OFF                             (16)

