Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_ETH_MAC_CONFIGURATION_DM_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_ETH_MAC_CONFIGURATION_DM_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_ETH_MAC_CONFIGURATION_DM_OFF                               (11)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_ETH_MAC_CONFIGURATION_DO_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_ETH_MAC_CONFIGURATION_DO_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_ETH_MAC_CONFIGURATION_DO_OFF                               (13)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_ETH_MAC_CONFIGURATION_DR_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_ETH_MAC_CONFIGURATION_DR_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_ETH_MAC_CONFIGURATION_DR_OFF                               (9)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_ETH_MAC_CONFIGURATION_FES_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_ETH_MAC_CONFIGURATION_FES_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_ETH_MAC_CONFIGURATION_FES_OFF                              (14)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.IFG */
#define IFX_ETH_MAC_CONFIGURATION_IFG_LEN                              (3)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.IFG */
#define IFX_ETH_MAC_CONFIGURATION_IFG_MSK                              (0x7)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.IFG */
#define IFX_ETH_MAC_CONFIGURATION_IFG_OFF                              (17)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_ETH_MAC_CONFIGURATION_IPC_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_ETH_MAC_CONFIGURATION_IPC_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_ETH_MAC_CONFIGURATION_IPC_OFF                              (10)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_ETH_MAC_CONFIGURATION_JD_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_ETH_MAC_CONFIGURATION_JD_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_ETH_MAC_CONFIGURATION_JD_OFF                               (22)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_ETH_MAC_CONFIGURATION_JE_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_ETH_MAC_CONFIGURATION_JE_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_ETH_MAC_CONFIGURATION_JE_OFF                               (20)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_ETH_MAC_CONFIGURATION_LM_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_ETH_MAC_CONFIGURATION_LM_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_ETH_MAC_CONFIGURATION_LM_OFF                               (12)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.LUD */
#define IFX_ETH_MAC_CONFIGURATION_LUD_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.LUD */
#define IFX_ETH_MAC_CONFIGURATION_LUD_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.LUD */
#define IFX_ETH_MAC_CONFIGURATION_LUD_OFF                              (8)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_ETH_MAC_CONFIGURATION_PRELEN_LEN                           (2)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_ETH_MAC_CONFIGURATION_PRELEN_MSK                           (0x3)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_ETH_MAC_CONFIGURATION_PRELEN_OFF                           (0)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_ETH_MAC_CONFIGURATION_PS_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_ETH_MAC_CONFIGURATION_PS_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_ETH_MAC_CONFIGURATION_PS_OFF                               (15)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_ETH_MAC_CONFIGURATION_RE_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_ETH_MAC_CONFIGURATION_RE_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_ETH_MAC_CONFIGURATION_RE_OFF                               (2)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.SFTERR */
#define IFX_ETH_MAC_CONFIGURATION_SFTERR_LEN                           (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.SFTERR */
#define IFX_ETH_MAC_CONFIGURATION_SFTERR_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.SFTERR */
#define IFX_ETH_MAC_CONFIGURATION_SFTERR_OFF                           (26)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.TC */
#define IFX_ETH_MAC_CONFIGURATION_TC_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.TC */
#define IFX_ETH_MAC_CONFIGURATION_TC_MSK                               (0x1)

