Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.TC */
#define IFX_ETH_MAC_CONFIGURATION_TC_OFF                               (24)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_ETH_MAC_CONFIGURATION_TE_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_ETH_MAC_CONFIGURATION_TE_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_ETH_MAC_CONFIGURATION_TE_OFF                               (3)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.TWOKPE */
#define IFX_ETH_MAC_CONFIGURATION_TWOKPE_LEN                           (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.TWOKPE */
#define IFX_ETH_MAC_CONFIGURATION_TWOKPE_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.TWOKPE */
#define IFX_ETH_MAC_CONFIGURATION_TWOKPE_OFF                           (27)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_ETH_MAC_CONFIGURATION_WD_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_ETH_MAC_CONFIGURATION_WD_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_ETH_MAC_CONFIGURATION_WD_OFF                               (23)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.DAIF */
#define IFX_ETH_MAC_FRAME_FILTER_DAIF_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.DAIF */
#define IFX_ETH_MAC_FRAME_FILTER_DAIF_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.DAIF */
#define IFX_ETH_MAC_FRAME_FILTER_DAIF_OFF                              (3)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.DBF */
#define IFX_ETH_MAC_FRAME_FILTER_DBF_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.DBF */
#define IFX_ETH_MAC_FRAME_FILTER_DBF_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.DBF */
#define IFX_ETH_MAC_FRAME_FILTER_DBF_OFF                               (5)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.DNTU */
#define IFX_ETH_MAC_FRAME_FILTER_DNTU_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.DNTU */
#define IFX_ETH_MAC_FRAME_FILTER_DNTU_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.DNTU */
#define IFX_ETH_MAC_FRAME_FILTER_DNTU_OFF                              (21)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.HMC */
#define IFX_ETH_MAC_FRAME_FILTER_HMC_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.HMC */
#define IFX_ETH_MAC_FRAME_FILTER_HMC_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.HMC */
#define IFX_ETH_MAC_FRAME_FILTER_HMC_OFF                               (2)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.HPF */
#define IFX_ETH_MAC_FRAME_FILTER_HPF_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.HPF */
#define IFX_ETH_MAC_FRAME_FILTER_HPF_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.HPF */
#define IFX_ETH_MAC_FRAME_FILTER_HPF_OFF                               (10)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.HUC */
#define IFX_ETH_MAC_FRAME_FILTER_HUC_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.HUC */
#define IFX_ETH_MAC_FRAME_FILTER_HUC_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.HUC */
#define IFX_ETH_MAC_FRAME_FILTER_HUC_OFF                               (1)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.IPFE */
#define IFX_ETH_MAC_FRAME_FILTER_IPFE_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.IPFE */
#define IFX_ETH_MAC_FRAME_FILTER_IPFE_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.IPFE */
#define IFX_ETH_MAC_FRAME_FILTER_IPFE_OFF                              (20)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.PCF */
#define IFX_ETH_MAC_FRAME_FILTER_PCF_LEN                               (2)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.PCF */
#define IFX_ETH_MAC_FRAME_FILTER_PCF_MSK                               (0x3)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.PCF */
#define IFX_ETH_MAC_FRAME_FILTER_PCF_OFF                               (6)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.PM */
#define IFX_ETH_MAC_FRAME_FILTER_PM_LEN                                (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.PM */
#define IFX_ETH_MAC_FRAME_FILTER_PM_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.PM */
#define IFX_ETH_MAC_FRAME_FILTER_PM_OFF                                (4)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.PR */
#define IFX_ETH_MAC_FRAME_FILTER_PR_LEN                                (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.PR */
#define IFX_ETH_MAC_FRAME_FILTER_PR_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.PR */
#define IFX_ETH_MAC_FRAME_FILTER_PR_OFF                                (0)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.RA */
#define IFX_ETH_MAC_FRAME_FILTER_RA_LEN                                (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.RA */
#define IFX_ETH_MAC_FRAME_FILTER_RA_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.RA */
#define IFX_ETH_MAC_FRAME_FILTER_RA_OFF                                (31)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.SAF */
#define IFX_ETH_MAC_FRAME_FILTER_SAF_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.SAF */
#define IFX_ETH_MAC_FRAME_FILTER_SAF_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.SAF */
#define IFX_ETH_MAC_FRAME_FILTER_SAF_OFF                               (9)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.SAIF */
#define IFX_ETH_MAC_FRAME_FILTER_SAIF_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.SAIF */
#define IFX_ETH_MAC_FRAME_FILTER_SAIF_MSK                              (0x1)

