Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.SAIF */
#define IFX_ETH_MAC_FRAME_FILTER_SAIF_OFF                              (8)

/** \brief  Length for Ifx_ETH_MAC_FRAME_FILTER_Bits.VTFE */
#define IFX_ETH_MAC_FRAME_FILTER_VTFE_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MAC_FRAME_FILTER_Bits.VTFE */
#define IFX_ETH_MAC_FRAME_FILTER_VTFE_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MAC_FRAME_FILTER_Bits.VTFE */
#define IFX_ETH_MAC_FRAME_FILTER_VTFE_OFF                              (16)

/** \brief  Length for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISCNTOVF_LEN (1)

/** \brief  Mask for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISCNTOVF_MSK (0x1)

/** \brief  Offset for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISCNTOVF_OFF (16)

/** \brief  Length for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISFRMCNT_LEN (16)

/** \brief  Mask for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISFRMCNT_MSK (0xffff)

/** \brief  Offset for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISFRMCNT_OFF (0)

/** \brief  Length for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFCNTOVF_LEN (1)

/** \brief  Mask for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFCNTOVF_MSK (0x1)

/** \brief  Offset for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFCNTOVF_OFF (28)

/** \brief  Length for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFFRMCNT_LEN (11)

/** \brief  Mask for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFFRMCNT_MSK (0x7ff)

/** \brief  Offset for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFFRMCNT_OFF (17)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_ETH_MMC_CONTROL_CNTFREEZ_LEN                               (1)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_ETH_MMC_CONTROL_CNTFREEZ_MSK                               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_ETH_MMC_CONTROL_CNTFREEZ_OFF                               (3)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_ETH_MMC_CONTROL_CNTPRST_LEN                                (1)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_ETH_MMC_CONTROL_CNTPRST_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_ETH_MMC_CONTROL_CNTPRST_OFF                                (4)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_ETH_MMC_CONTROL_CNTPRSTLVL_LEN                             (1)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_ETH_MMC_CONTROL_CNTPRSTLVL_MSK                             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_ETH_MMC_CONTROL_CNTPRSTLVL_OFF                             (5)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_ETH_MMC_CONTROL_CNTRST_LEN                                 (1)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_ETH_MMC_CONTROL_CNTRST_MSK                                 (0x1)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_ETH_MMC_CONTROL_CNTRST_OFF                                 (0)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_ETH_MMC_CONTROL_CNTSTOPRO_LEN                              (1)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_ETH_MMC_CONTROL_CNTSTOPRO_MSK                              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_ETH_MMC_CONTROL_CNTSTOPRO_OFF                              (1)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_ETH_MMC_CONTROL_RSTONRD_LEN                                (1)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_ETH_MMC_CONTROL_RSTONRD_MSK                                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_ETH_MMC_CONTROL_RSTONRD_OFF                                (2)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_ETH_MMC_CONTROL_UCDBC_LEN                                  (1)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_ETH_MMC_CONTROL_UCDBC_MSK                                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_ETH_MMC_CONTROL_UCDBC_OFF                                  (8)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPERFIM_LEN         (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPERFIM_MSK         (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPERFIM_OFF         (13)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPEROIM_LEN         (1)

