Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPEROIM_MSK         (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPEROIM_OFF         (29)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGFIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGFIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGFIM_OFF          (12)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGOIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGOIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGOIM_OFF          (28)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGFIM_LEN       (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGFIM_MSK       (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGFIM_OFF       (3)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGOIM_LEN       (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGOIM_MSK       (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGOIM_OFF       (19)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4GFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4GFIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4GFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4GFIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4GFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4GFIM_OFF          (0)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4GOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4GOIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4GOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4GOIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4GOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4GOIM_OFF          (16)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4HERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4HERFIM_LEN        (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4HERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4HERFIM_MSK        (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4HERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4HERFIM_OFF        (1)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4HEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4HEROIM_LEN        (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4HEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4HEROIM_MSK        (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4HEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4HEROIM_OFF        (17)

/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4NOPAYFIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4NOPAYFIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4NOPAYFIM_OFF      (2)

/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4NOPAYOIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4NOPAYOIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4NOPAYOIM_OFF      (18)

/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4UDSBLFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4UDSBLFIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4UDSBLFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4UDSBLFIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4UDSBLFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4UDSBLFIM_OFF      (4)

/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4UDSBLOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4UDSBLOIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4UDSBLOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4UDSBLOIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4UDSBLOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4UDSBLOIM_OFF      (20)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6GFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6GFIM_LEN          (1)

