Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6GFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6GFIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6GFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6GFIM_OFF          (5)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6GOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6GOIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6GOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6GOIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6GOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6GOIM_OFF          (21)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6HERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6HERFIM_LEN        (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6HERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6HERFIM_MSK        (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6HERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6HERFIM_OFF        (6)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6HEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6HEROIM_LEN        (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6HEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6HEROIM_MSK        (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6HEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6HEROIM_OFF        (22)

/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYFIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYFIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYFIM_OFF      (7)

/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYOIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYOIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYOIM_OFF      (23)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPERFIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPERFIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPERFIM_OFF          (11)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPEROIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPEROIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPEROIM_OFF          (27)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGFIM_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGFIM_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGFIM_OFF           (10)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGOIM_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGOIM_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGOIM_OFF           (26)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPERFIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPERFIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPERFIM_OFF          (9)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPEROIM_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPEROIM_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPEROIM_OFF          (25)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGFIM_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGFIM_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGFIM_OFF           (8)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGOIM_LEN           (1)

