Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGOIM_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGOIM_OFF           (24)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPERFIS_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPERFIS_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPERFIS_OFF              (13)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPEROIS_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPEROIS_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPEROIS_OFF              (29)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGFIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGFIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGFIS_OFF               (12)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGOIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGOIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGOIS_OFF               (28)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGFIS_LEN            (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGFIS_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGFIS_OFF            (3)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGOIS_LEN            (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGOIS_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4FRAGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4FRAGOIS_OFF            (19)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GFIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GFIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GFIS_OFF               (0)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GOIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GOIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4GOIS_OFF               (16)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HERFIS_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HERFIS_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HERFIS_OFF             (1)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HEROIS_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HEROIS_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4HEROIS_OFF             (17)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYFIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYFIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYFIS_OFF           (2)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYOIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYOIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4NOPAYOIS_OFF           (18)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLFIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLFIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLFIS_OFF           (4)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLOIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLOIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV4UDSBLOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV4UDSBLOIS_OFF           (20)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GFIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GFIS_MSK               (0x1)

