Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GFIS_OFF               (5)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GOIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GOIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6GOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6GOIS_OFF               (21)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HERFIS_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HERFIS_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HERFIS_OFF             (6)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HEROIS_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HEROIS_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6HEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6HEROIS_OFF             (22)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6NOPAYFIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6NOPAYFIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6NOPAYFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6NOPAYFIS_OFF           (7)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6NOPAYOIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6NOPAYOIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXIPV6NOPAYOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXIPV6NOPAYOIS_OFF           (23)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPERFIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPERFIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPERFIS_OFF               (11)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPEROIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPEROIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPEROIS_OFF               (27)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGFIS_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGFIS_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGFIS_OFF                (10)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGOIS_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGOIS_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGOIS_OFF                (26)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPERFIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPERFIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPERFIS_OFF               (9)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPEROIS_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPEROIS_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPEROIS_OFF               (25)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGFIS_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGFIS_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGFIS_OFF                (8)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGOIS_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGOIS_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGOIS_OFF                (24)

