Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX1024TMAXOCTGBFIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX1024TMAXOCTGBFIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX1024TMAXOCTGBFIM_OFF      (16)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX128T255OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX128T255OCTGBFIM_LEN       (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX128T255OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX128T255OCTGBFIM_MSK       (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX128T255OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX128T255OCTGBFIM_OFF       (13)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX256T511OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX256T511OCTGBFIM_LEN       (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX256T511OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX256T511OCTGBFIM_MSK       (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX256T511OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX256T511OCTGBFIM_OFF       (14)

/** \brief  Length for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX512T1023OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX512T1023OCTGBFIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX512T1023OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX512T1023OCTGBFIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX512T1023OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX512T1023OCTGBFIM_OFF      (15)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX64OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX64OCTGBFIM_LEN            (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX64OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX64OCTGBFIM_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX64OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX64OCTGBFIM_OFF            (11)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX65T127OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX65T127OCTGBFIM_LEN        (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX65T127OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX65T127OCTGBFIM_MSK        (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX65T127OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX65T127OCTGBFIM_OFF        (12)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXALGNERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXALGNERFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXALGNERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXALGNERFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXALGNERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXALGNERFIM_OFF             (6)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXBCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXBCGFIM_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXBCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXBCGFIM_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXBCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXBCGFIM_OFF                (3)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCRCERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCRCERFIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCRCERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCRCERFIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCRCERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCRCERFIM_OFF              (5)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCTRLFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCTRLFIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCTRLFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCTRLFIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCTRLFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCTRLFIM_OFF               (25)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXFOVFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXFOVFIM_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXFOVFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXFOVFIM_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXFOVFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXFOVFIM_OFF                (21)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBFRMIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBFRMIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBFRMIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBFRMIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBFRMIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBFRMIM_OFF               (0)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBOCTIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBOCTIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBOCTIM_OFF               (1)

