Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGOCTIM_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGOCTIM_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGOCTIM_OFF                (2)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXJABERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXJABERFIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXJABERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXJABERFIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXJABERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXJABERFIM_OFF              (8)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXLENERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXLENERFIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXLENERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXLENERFIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXLENERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXLENERFIM_OFF              (18)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXMCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXMCGFIM_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXMCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXMCGFIM_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXMCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXMCGFIM_OFF                (4)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXORANGEFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXORANGEFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXORANGEFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXORANGEFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXORANGEFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXORANGEFIM_OFF             (19)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXOSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXOSIZEGFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXOSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXOSIZEGFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXOSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXOSIZEGFIM_OFF             (10)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXPAUSFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXPAUSFIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXPAUSFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXPAUSFIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXPAUSFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXPAUSFIM_OFF               (20)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRCVERRFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRCVERRFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRCVERRFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRCVERRFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRCVERRFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRCVERRFIM_OFF             (24)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRUNTFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRUNTFIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRUNTFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRUNTFIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRUNTFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRUNTFIM_OFF               (7)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUCGFIM_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUCGFIM_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUCGFIM_OFF                (17)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUSIZEGFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUSIZEGFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUSIZEGFIM_OFF             (9)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXVLANGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXVLANGBFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXVLANGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXVLANGBFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXVLANGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXVLANGBFIM_OFF             (22)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXWDOGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXWDOGFIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXWDOGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXWDOGFIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXWDOGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXWDOGFIM_OFF               (23)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX1024TMAXOCTGBFIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX1024TMAXOCTGBFIS_MSK           (0x1)

