Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX1024TMAXOCTGBFIS_OFF           (16)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX128T255OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX128T255OCTGBFIS_LEN            (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX128T255OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX128T255OCTGBFIS_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX128T255OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX128T255OCTGBFIS_OFF            (13)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX256T511OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX256T511OCTGBFIS_LEN            (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX256T511OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX256T511OCTGBFIS_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX256T511OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX256T511OCTGBFIS_OFF            (14)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX512T1023OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX512T1023OCTGBFIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX512T1023OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX512T1023OCTGBFIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX512T1023OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX512T1023OCTGBFIS_OFF           (15)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX64OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX64OCTGBFIS_LEN                 (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX64OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX64OCTGBFIS_MSK                 (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX64OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX64OCTGBFIS_OFF                 (11)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX65T127OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX65T127OCTGBFIS_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX65T127OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX65T127OCTGBFIS_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX65T127OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX65T127OCTGBFIS_OFF             (12)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_OFF                  (6)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_LEN                     (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_MSK                     (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_OFF                     (3)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_LEN                   (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_MSK                   (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_OFF                   (5)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_OFF                    (25)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_LEN                     (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_MSK                     (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_OFF                     (21)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_OFF                    (0)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_OFF                    (1)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_LEN                     (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_MSK                     (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_OFF                     (2)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_LEN                   (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_MSK                   (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_OFF                   (8)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_LEN                   (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_MSK                   (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_OFF                   (18)

