Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_LEN                     (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_MSK                     (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_OFF                     (4)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_OFF                  (19)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_OFF                  (10)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_OFF                    (20)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_OFF                  (24)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_OFF                    (7)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUCGFIS_LEN                     (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUCGFIS_MSK                     (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUCGFIS_OFF                     (17)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUSIZEGFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUSIZEGFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUSIZEGFIS_OFF                  (9)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXVLANGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXVLANGBFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXVLANGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXVLANGBFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXVLANGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXVLANGBFIS_OFF                  (22)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXWDOGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXWDOGFIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXWDOGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXWDOGFIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXWDOGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXWDOGFIS_OFF                    (23)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX1024TMAXOCTGBFIM_LEN     (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX1024TMAXOCTGBFIM_MSK     (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX1024TMAXOCTGBFIM_OFF     (9)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX128T255OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX128T255OCTGBFIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX128T255OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX128T255OCTGBFIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX128T255OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX128T255OCTGBFIM_OFF      (6)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX256T511OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX256T511OCTGBFIM_LEN      (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX256T511OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX256T511OCTGBFIM_MSK      (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX256T511OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX256T511OCTGBFIM_OFF      (7)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX512T1023OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX512T1023OCTGBFIM_LEN     (1)

