Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX512T1023OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX512T1023OCTGBFIM_MSK     (0x1)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX512T1023OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX512T1023OCTGBFIM_OFF     (8)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX64OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX64OCTGBFIM_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX64OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX64OCTGBFIM_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX64OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX64OCTGBFIM_OFF           (4)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX65T127OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX65T127OCTGBFIM_LEN       (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX65T127OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX65T127OCTGBFIM_MSK       (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX65T127OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX65T127OCTGBFIM_OFF       (5)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGBFIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGBFIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGBFIM_OFF              (12)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGFIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGFIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGFIM_OFF               (2)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXCARERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXCARERFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXCARERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXCARERFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXCARERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXCARERFIM_OFF             (19)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXDEFFIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXDEFFIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXDEFFIM_OFF               (16)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXCOLFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXCOLFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXCOLFIM_OFF             (18)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXDEFFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXDEFFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXDEFFIM_OFF             (22)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBFRMIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBFRMIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBFRMIM_OFF              (1)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBOCTIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBOCTIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBOCTIM_OFF              (0)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGFRMIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGFRMIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGFRMIM_OFF               (21)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGOCTIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGOCTIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGOCTIM_OFF               (20)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXLATCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXLATCOLFIM_LEN            (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXLATCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXLATCOLFIM_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXLATCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXLATCOLFIM_OFF            (17)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGBFIM_LEN              (1)

