Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGBFIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGBFIM_OFF              (11)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGFIM_LEN               (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGFIM_MSK               (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGFIM_OFF               (3)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCOLGFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCOLGFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCOLGFIM_OFF             (15)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXOSIZEGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXOSIZEGFIM_LEN            (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXOSIZEGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXOSIZEGFIM_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXOSIZEGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXOSIZEGFIM_OFF            (25)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXPAUSFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXPAUSFIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXPAUSFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXPAUSFIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXPAUSFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXPAUSFIM_OFF              (23)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXSCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXSCOLGFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXSCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXSCOLGFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXSCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXSCOLGFIM_OFF             (14)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUCGBFIM_LEN              (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUCGBFIM_MSK              (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUCGBFIM_OFF              (10)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUFLOWERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUFLOWERFIM_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUFLOWERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUFLOWERFIM_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXUFLOWERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXUFLOWERFIM_OFF           (13)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXVLANGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXVLANGFIM_LEN             (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXVLANGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXVLANGFIM_MSK             (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXVLANGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXVLANGFIM_OFF             (24)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX1024TMAXOCTGBFIS_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX1024TMAXOCTGBFIS_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX1024TMAXOCTGBFIS_OFF          (9)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX128T255OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX128T255OCTGBFIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX128T255OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX128T255OCTGBFIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX128T255OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX128T255OCTGBFIS_OFF           (6)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX256T511OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX256T511OCTGBFIS_LEN           (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX256T511OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX256T511OCTGBFIS_MSK           (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX256T511OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX256T511OCTGBFIS_OFF           (7)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX512T1023OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX512T1023OCTGBFIS_LEN          (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX512T1023OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX512T1023OCTGBFIS_MSK          (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX512T1023OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX512T1023OCTGBFIS_OFF          (8)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX64OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX64OCTGBFIS_LEN                (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX64OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX64OCTGBFIS_MSK                (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX64OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX64OCTGBFIS_OFF                (4)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX65T127OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX65T127OCTGBFIS_LEN            (1)

