Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX65T127OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX65T127OCTGBFIS_MSK            (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TX65T127OCTGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TX65T127OCTGBFIS_OFF            (5)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGBFIS_LEN                   (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGBFIS_MSK                   (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGBFIS_OFF                   (12)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGFIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGFIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGFIS_OFF                    (2)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_OFF                  (19)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_OFF                    (16)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_OFF                  (18)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_LEN                  (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_MSK                  (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_OFF                  (22)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_LEN                   (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_MSK                   (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_OFF                   (1)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_LEN                   (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_MSK                   (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_OFF                   (0)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_OFF                    (21)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_OFF                    (20)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_LEN                 (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_MSK                 (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_OFF                 (17)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_LEN                   (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_MSK                   (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_OFF                   (11)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_LEN                    (1)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_MSK                    (0x1)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_OFF                    (3)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS_LEN                  (1)

