Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_OFF                        (2)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_LEN                        (1)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_OFF                        (6)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_LEN                                (3)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_MSK                                (0x7)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_OFF                                (8)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_LEN                                (3)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_MSK                                (0x7)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_OFF                                (16)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD3 */
#define IFX_ETH_PPS_CONTROL_PPSCMD3_LEN                                (3)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD3 */
#define IFX_ETH_PPS_CONTROL_PPSCMD3_MSK                                (0x7)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD3 */
#define IFX_ETH_PPS_CONTROL_PPSCMD3_OFF                                (24)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_LEN                         (4)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_MSK                         (0xf)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_OFF                         (0)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_LEN                                 (1)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_MSK                                 (0x1)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_OFF                                 (4)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_LEN                            (2)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_MSK                            (0x3)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_OFF                            (5)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_LEN                            (2)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_MSK                            (0x3)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_OFF                            (13)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_LEN                            (2)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_MSK                            (0x3)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_OFF                            (21)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_LEN                            (2)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_MSK                            (0x3)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_OFF                            (29)

/** \brief  Length for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_LEN             (30)

/** \brief  Mask for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_MSK             (0x3fffffff)

/** \brief  Offset for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_OFF             (2)

/** \brief  Length for Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits.RIWT */
#define IFX_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_LEN              (8)

/** \brief  Mask for Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits.RIWT */
#define IFX_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_MSK              (0xff)

/** \brief  Offset for Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits.RIWT */
#define IFX_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_OFF              (0)

/** \brief  Length for Ifx_ETH_RECEIVE_POLL_DEMAND_Bits.RPD */
#define IFX_ETH_RECEIVE_POLL_DEMAND_RPD_LEN                            (32)

/** \brief  Mask for Ifx_ETH_RECEIVE_POLL_DEMAND_Bits.RPD */
#define IFX_ETH_RECEIVE_POLL_DEMAND_RPD_MSK                            (0xffffffff)

/** \brief  Offset for Ifx_ETH_RECEIVE_POLL_DEMAND_Bits.RPD */
#define IFX_ETH_RECEIVE_POLL_DEMAND_RPD_OFF                            (0)

/** \brief  Length for Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits.WKUPFRMFTR */
#define IFX_ETH_REMOTE_WAKE_UP_FRAME_FILTER_WKUPFRMFTR_LEN             (32)

/** \brief  Mask for Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits.WKUPFRMFTR */
#define IFX_ETH_REMOTE_WAKE_UP_FRAME_FILTER_WKUPFRMFTR_MSK             (0xffffffff)

