Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits.WKUPFRMFTR */
#define IFX_ETH_REMOTE_WAKE_UP_FRAME_FILTER_WKUPFRMFTR_OFF             (0)

/** \brief  Length for
 * Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_RX1024_MAXOCTGB_LEN (32)

/** \brief  Mask for
 * Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_RX1024_MAXOCTGB_MSK (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_RX1024_MAXOCTGB_OFF (0)

/** \brief  Length for
 * Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_RX128_255OCTGB_LEN   (32)

/** \brief  Mask for
 * Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_RX128_255OCTGB_MSK   (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_RX128_255OCTGB_OFF   (0)

/** \brief  Length for
 * Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_RX256_511OCTGB_LEN   (32)

/** \brief  Mask for
 * Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_RX256_511OCTGB_MSK   (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_RX256_511OCTGB_OFF   (0)

/** \brief  Length for
 * Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_RX512_1023OCTGB_LEN (32)

/** \brief  Mask for
 * Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_RX512_1023OCTGB_MSK (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_RX512_1023OCTGB_OFF (0)

/** \brief  Length for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_LEN              (32)

/** \brief  Mask for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_MSK              (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_OFF              (0)

/** \brief  Length for
 * Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_LEN     (32)

/** \brief  Mask for Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_MSK     (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_OFF     (0)

/** \brief  Length for Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits.RXALGNERR */
#define IFX_ETH_RX_ALIGNMENT_ERROR_FRAMES_RXALGNERR_LEN                (32)

/** \brief  Mask for Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits.RXALGNERR */
#define IFX_ETH_RX_ALIGNMENT_ERROR_FRAMES_RXALGNERR_MSK                (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits.RXALGNERR */
#define IFX_ETH_RX_ALIGNMENT_ERROR_FRAMES_RXALGNERR_OFF                (0)

/** \brief  Length for Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits.RXBCASTG */
#define IFX_ETH_RX_BROADCAST_FRAMES_GOOD_RXBCASTG_LEN                  (32)

/** \brief  Mask for Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits.RXBCASTG */
#define IFX_ETH_RX_BROADCAST_FRAMES_GOOD_RXBCASTG_MSK                  (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits.RXBCASTG */
#define IFX_ETH_RX_BROADCAST_FRAMES_GOOD_RXBCASTG_OFF                  (0)

/** \brief  Length for Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits.RXCTRLG */
#define IFX_ETH_RX_CONTROL_FRAMES_GOOD_RXCTRLG_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits.RXCTRLG */
#define IFX_ETH_RX_CONTROL_FRAMES_GOOD_RXCTRLG_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits.RXCTRLG */
#define IFX_ETH_RX_CONTROL_FRAMES_GOOD_RXCTRLG_OFF                     (0)

/** \brief  Length for Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits.RXCRCERR */
#define IFX_ETH_RX_CRC_ERROR_FRAMES_RXCRCERR_LEN                       (32)

/** \brief  Mask for Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits.RXCRCERR */
#define IFX_ETH_RX_CRC_ERROR_FRAMES_RXCRCERR_MSK                       (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits.RXCRCERR */
#define IFX_ETH_RX_CRC_ERROR_FRAMES_RXCRCERR_OFF                       (0)

/** \brief  Length for Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits.RXFIFOOVFL */
#define IFX_ETH_RX_FIFO_OVERFLOW_FRAMES_RXFIFOOVFL_LEN                 (32)

/** \brief  Mask for Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits.RXFIFOOVFL */
#define IFX_ETH_RX_FIFO_OVERFLOW_FRAMES_RXFIFOOVFL_MSK                 (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits.RXFIFOOVFL */
#define IFX_ETH_RX_FIFO_OVERFLOW_FRAMES_RXFIFOOVFL_OFF                 (0)

/** \brief  Length for Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits.RXFRMGB */
#define IFX_ETH_RX_FRAMES_COUNT_GOOD_BAD_RXFRMGB_LEN                   (32)

/** \brief  Mask for Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits.RXFRMGB */
#define IFX_ETH_RX_FRAMES_COUNT_GOOD_BAD_RXFRMGB_MSK                   (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits.RXFRMGB */
#define IFX_ETH_RX_FRAMES_COUNT_GOOD_BAD_RXFRMGB_OFF                   (0)

/** \brief  Length for Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits.RXJABERR */
#define IFX_ETH_RX_JABBER_ERROR_FRAMES_RXJABERR_LEN                    (32)

/** \brief  Mask for Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits.RXJABERR */
#define IFX_ETH_RX_JABBER_ERROR_FRAMES_RXJABERR_MSK                    (0xffffffff)

