Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits.RXJABERR */
#define IFX_ETH_RX_JABBER_ERROR_FRAMES_RXJABERR_OFF                    (0)

/** \brief  Length for Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits.RXLENERR */
#define IFX_ETH_RX_LENGTH_ERROR_FRAMES_RXLENERR_LEN                    (32)

/** \brief  Mask for Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits.RXLENERR */
#define IFX_ETH_RX_LENGTH_ERROR_FRAMES_RXLENERR_MSK                    (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits.RXLENERR */
#define IFX_ETH_RX_LENGTH_ERROR_FRAMES_RXLENERR_OFF                    (0)

/** \brief  Length for Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits.RXMCASTG */
#define IFX_ETH_RX_MULTICAST_FRAMES_GOOD_RXMCASTG_LEN                  (32)

/** \brief  Mask for Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits.RXMCASTG */
#define IFX_ETH_RX_MULTICAST_FRAMES_GOOD_RXMCASTG_MSK                  (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits.RXMCASTG */
#define IFX_ETH_RX_MULTICAST_FRAMES_GOOD_RXMCASTG_OFF                  (0)

/** \brief  Length for Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_LEN                    (32)

/** \brief  Mask for Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_MSK                    (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_OFF                    (0)

/** \brief  Length for Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_RXOCTG_LEN                         (32)

/** \brief  Mask for Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_RXOCTG_MSK                         (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_ETH_RX_OCTET_COUNT_GOOD_RXOCTG_OFF                         (0)

/** \brief  Length for Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits.RXOUTOFRNG */
#define IFX_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_RXOUTOFRNG_LEN             (32)

/** \brief  Mask for Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits.RXOUTOFRNG */
#define IFX_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_RXOUTOFRNG_MSK             (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits.RXOUTOFRNG */
#define IFX_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_RXOUTOFRNG_OFF             (0)

/** \brief  Length for Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits.RXOVERSZG */
#define IFX_ETH_RX_OVERSIZE_FRAMES_GOOD_RXOVERSZG_LEN                  (32)

/** \brief  Mask for Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits.RXOVERSZG */
#define IFX_ETH_RX_OVERSIZE_FRAMES_GOOD_RXOVERSZG_MSK                  (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits.RXOVERSZG */
#define IFX_ETH_RX_OVERSIZE_FRAMES_GOOD_RXOVERSZG_OFF                  (0)

/** \brief  Length for Ifx_ETH_RX_PAUSE_FRAMES_Bits.RXPAUSEFRM */
#define IFX_ETH_RX_PAUSE_FRAMES_RXPAUSEFRM_LEN                         (32)

/** \brief  Mask for Ifx_ETH_RX_PAUSE_FRAMES_Bits.RXPAUSEFRM */
#define IFX_ETH_RX_PAUSE_FRAMES_RXPAUSEFRM_MSK                         (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_PAUSE_FRAMES_Bits.RXPAUSEFRM */
#define IFX_ETH_RX_PAUSE_FRAMES_RXPAUSEFRM_OFF                         (0)

/** \brief  Length for Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits.RXRCVERR */
#define IFX_ETH_RX_RECEIVE_ERROR_FRAMES_RXRCVERR_LEN                   (32)

/** \brief  Mask for Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits.RXRCVERR */
#define IFX_ETH_RX_RECEIVE_ERROR_FRAMES_RXRCVERR_MSK                   (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits.RXRCVERR */
#define IFX_ETH_RX_RECEIVE_ERROR_FRAMES_RXRCVERR_OFF                   (0)

/** \brief  Length for Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits.RXRUNTERR */
#define IFX_ETH_RX_RUNT_ERROR_FRAMES_RXRUNTERR_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits.RXRUNTERR */
#define IFX_ETH_RX_RUNT_ERROR_FRAMES_RXRUNTERR_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits.RXRUNTERR */
#define IFX_ETH_RX_RUNT_ERROR_FRAMES_RXRUNTERR_OFF                     (0)

/** \brief  Length for Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits.RXUNDERSZG */
#define IFX_ETH_RX_UNDERSIZE_FRAMES_GOOD_RXUNDERSZG_LEN                (32)

/** \brief  Mask for Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits.RXUNDERSZG */
#define IFX_ETH_RX_UNDERSIZE_FRAMES_GOOD_RXUNDERSZG_MSK                (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits.RXUNDERSZG */
#define IFX_ETH_RX_UNDERSIZE_FRAMES_GOOD_RXUNDERSZG_OFF                (0)

/** \brief  Length for Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits.RXUCASTG */
#define IFX_ETH_RX_UNICAST_FRAMES_GOOD_RXUCASTG_LEN                    (32)

/** \brief  Mask for Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits.RXUCASTG */
#define IFX_ETH_RX_UNICAST_FRAMES_GOOD_RXUCASTG_MSK                    (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits.RXUCASTG */
#define IFX_ETH_RX_UNICAST_FRAMES_GOOD_RXUCASTG_OFF                    (0)

/** \brief  Length for Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits.RXVLANFRGB */
#define IFX_ETH_RX_VLAN_FRAMES_GOOD_BAD_RXVLANFRGB_LEN                 (32)

/** \brief  Mask for Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits.RXVLANFRGB */
#define IFX_ETH_RX_VLAN_FRAMES_GOOD_BAD_RXVLANFRGB_MSK                 (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits.RXVLANFRGB */
#define IFX_ETH_RX_VLAN_FRAMES_GOOD_BAD_RXVLANFRGB_OFF                 (0)

/** \brief  Length for Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits.RXWDGERR */
#define IFX_ETH_RX_WATCHDOG_ERROR_FRAMES_RXWDGERR_LEN                  (32)

/** \brief  Mask for Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits.RXWDGERR */
#define IFX_ETH_RX_WATCHDOG_ERROR_FRAMES_RXWDGERR_MSK                  (0xffffffff)

/** \brief  Offset for Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits.RXWDGERR */
#define IFX_ETH_RX_WATCHDOG_ERROR_FRAMES_RXWDGERR_OFF                  (0)

