Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_RXICMP_ERROR_FRAMES_Bits.RXICMPERRFRM */
#define IFX_ETH_RXICMP_ERROR_FRAMES_RXICMPERRFRM_LEN                   (32)

/** \brief  Mask for Ifx_ETH_RXICMP_ERROR_FRAMES_Bits.RXICMPERRFRM */
#define IFX_ETH_RXICMP_ERROR_FRAMES_RXICMPERRFRM_MSK                   (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXICMP_ERROR_FRAMES_Bits.RXICMPERRFRM */
#define IFX_ETH_RXICMP_ERROR_FRAMES_RXICMPERRFRM_OFF                   (0)

/** \brief  Length for Ifx_ETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_ETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_LEN                   (32)

/** \brief  Mask for Ifx_ETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_ETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_MSK                   (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_ETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_OFF                   (0)

/** \brief  Length for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_LEN             (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_MSK             (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_OFF             (0)

/** \brief  Length for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_LEN             (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_MSK             (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_OFF             (0)

/** \brief  Length for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_LEN         (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_MSK         (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_OFF         (0)

/** \brief  Length for Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_ETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_LEN         (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_ETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_MSK         (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_ETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_OFF         (0)

/** \brief  Length for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_LEN            (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_MSK            (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_OFF            (0)

/** \brief  Length for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_LEN            (32)

/** \brief  Mask for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_MSK            (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_OFF            (0)

/** \brief  Length for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_LEN  (32)

/** \brief  Mask for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_MSK  (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_OFF  (0)

