Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_LEN (32)

/** \brief  Mask for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_MSK (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_OFF (0)

/** \brief  Length for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_LEN         (32)

/** \brief  Mask for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_MSK         (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_OFF         (0)

/** \brief  Length for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_LEN         (32)

/** \brief  Mask for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_MSK         (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_OFF         (0)

/** \brief  Length for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_LEN            (32)

/** \brief  Mask for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_MSK            (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_OFF            (0)

/** \brief  Length for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_LEN            (32)

/** \brief  Mask for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_MSK            (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_OFF            (0)

/** \brief  Length for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_LEN                       (32)

/** \brief  Mask for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_MSK                       (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_OFF                       (0)

/** \brief  Length for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_LEN                       (32)

/** \brief  Mask for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_MSK                       (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_OFF                       (0)

/** \brief  Length for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_LEN                     (32)

/** \brief  Mask for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_OFF                     (0)

/** \brief  Length for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_LEN                       (32)

/** \brief  Mask for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_MSK                       (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_OFF                       (0)

/** \brief  Length for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_LEN                       (32)

/** \brief  Mask for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_MSK                       (0xffffffff)

/** \brief  Offset for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_OFF                       (0)

/** \brief  Length for Ifx_ETH_STATUS_Bits.AIS */
#define IFX_ETH_STATUS_AIS_LEN                                         (1)

