Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_MSK                           (0xffffffff)

/** \brief  Offset for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_OFF                           (0)

/** \brief  Length for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_LEN                              (32)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_MSK                              (0xffffffff)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_OFF                              (0)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_OFF                           (25)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_OFF                           (26)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_OFF                           (27)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_OFF                           (28)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_LEN                            (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_MSK                            (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_OFF                            (24)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_LEN                       (2)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_MSK                       (0x3)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_OFF                       (16)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_LEN                         (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_MSK                         (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_OFF                         (5)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_LEN                         (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_MSK                         (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_OFF                         (1)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_OFF                        (9)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_LEN                            (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_MSK                            (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_OFF                            (0)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_LEN                          (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_MSK                          (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_OFF                          (8)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_LEN                      (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_MSK                      (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_OFF                      (18)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_MSK                        (0x1)

