Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_OFF                        (14)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_OFF                           (2)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_LEN                          (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_MSK                          (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_OFF                          (11)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_OFF                        (13)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_OFF                        (12)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_OFF                        (15)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_OFF                           (4)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_OFF                           (3)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_OFF                        (10)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_LEN                             (5)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_MSK                             (0x1f)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_OFF                             (25)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_LEN                            (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_MSK                            (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_OFF                            (24)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_LEN                            (4)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_MSK                            (0xf)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_OFF                            (16)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_LEN                         (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_MSK                         (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_OFF                         (2)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_LEN                            (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_MSK                            (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_OFF                            (0)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_LEN                          (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_MSK                          (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_OFF                          (4)

