Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_LEN                          (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_MSK                          (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_OFF                          (6)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_LEN                          (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_MSK                          (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_OFF                          (8)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_LEN                           (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_MSK                           (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_OFF                           (1)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_OFF                        (5)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_OFF                        (7)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_LEN                        (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_MSK                        (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_OFF                        (9)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_LEN                         (1)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_MSK                         (0x1)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_OFF                         (3)

/** \brief  Length for Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_LEN            (30)

/** \brief  Mask for Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_MSK            (0x3fffffff)

/** \brief  Offset for Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_OFF            (2)

/** \brief  Length for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_LEN                           (32)

/** \brief  Mask for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_MSK                           (0xffffffff)

/** \brief  Offset for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_OFF                           (0)

/** \brief  Length for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_LEN (32)

/** \brief  Mask for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_MSK (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_OFF (0)

/** \brief  Length for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_LEN   (32)

/** \brief  Mask for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_MSK   (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_OFF   (0)

/** \brief  Length for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_LEN   (32)

/** \brief  Mask for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_MSK   (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_OFF   (0)

/** \brief  Length for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_LEN (32)

/** \brief  Mask for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_MSK (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_OFF (0)

/** \brief  Length for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_LEN              (32)

