Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_MSK              (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_OFF              (0)

/** \brief  Length for
 * Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_LEN     (32)

/** \brief  Mask for Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_MSK     (0xffffffff)

/** \brief  Offset for
 * Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_OFF     (0)

/** \brief  Length for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_LEN             (32)

/** \brief  Mask for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_MSK             (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_OFF             (0)

/** \brief  Length for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_LEN                  (32)

/** \brief  Mask for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_MSK                  (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_OFF                  (0)

/** \brief  Length for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_LEN                     (32)

/** \brief  Mask for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_MSK                     (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_OFF                     (0)

/** \brief  Length for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_LEN                         (32)

/** \brief  Mask for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_MSK                         (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_OFF                         (0)

/** \brief  Length for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_LEN             (32)

/** \brief  Mask for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_MSK             (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_OFF             (0)

/** \brief  Length for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_LEN               (32)

/** \brief  Mask for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MSK               (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_OFF               (0)

/** \brief  Length for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_LEN                    (32)

/** \brief  Mask for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_MSK                    (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_OFF                    (0)

/** \brief  Length for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_LEN                         (32)

/** \brief  Mask for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_MSK                         (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_OFF                         (0)

/** \brief  Length for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_LEN                 (32)

/** \brief  Mask for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_MSK                 (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_OFF                 (0)

/** \brief  Length for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_LEN             (32)

/** \brief  Mask for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_MSK             (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_OFF             (0)

/** \brief  Length for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_LEN                  (32)

/** \brief  Mask for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_MSK                  (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_OFF                  (0)

/** \brief  Length for Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_LEN       (32)

/** \brief  Mask for Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_MSK       (0xffffffff)

/** \brief  Offset for Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_OFF       (0)

